# SelectObj

## Description
Selects all objects which match the search criteria.

```pascal
PROCEDURE SelectObj(c : CRITERIA);
```

```python
def vs.SelectObj(c):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|Search criteria.|

## Examples
lectandDelObjects}}

## Version
Availability: from All Versions

## Category
* Criteria